src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <comment>Аналог документа из Розницы.</comment>
  <attributes>
    <name>ЗаполнениеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КонтрагентыРозница</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.МагазиныРозница</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СкладыРозница</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникЗаполнившийПоступление</name>
    <type>
      <types>CatalogRef.СотрудникиСклада</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураРозница</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеТоваров/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура устанавливает флаг, указывающий на то, что заполнение документа завершено.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиСклада
Процедура ЗавершитьЗаполнение(Знач Сотрудник) Экспорт

    СотрудникЗаполнившийПоступление = Сотрудник;
    ЗаполнениеЗавершено = Истина;

    Записать();

КонецПроцедуры

// Процедура обновляет количество товара.
// 
// Параметры:
//  НомерТовара - Число - Номер строки табличной части Товары
//  НовоеКоличествоТовара - Число
Процедура ОбновитьКоличествоТовара(Знач НомерТовара, Знач НовоеКоличествоТовара) Экспорт
                                            
    // 1. Получение строки табличной части Номенклатура
    Товар = Товары.Получить(НомерТовара - 1);
    
    // 2. Обновление количества принятого товара
    Товар.Количество = НовоеКоличествоТовара;

    Записать();

КонецПроцедуры

// Процедура удаляет товар из табличной части по номеру.
// 
// Параметры:
//  НомерТовара - Число
Процедура УдалитьТовар(Знач НомерТовара) Экспорт

    Товары.Удалить(НомерТовара - 1);

    Записать();

КонецПроцедуры

#КонецОбласти
